r4d10n/hx-esp32-cam-fpv/esp32-gs-usb-test/sdkconfig.defaults
# USB NCM Test - SDK Configuration

# Target ESP32-S3
CONFIG_IDF_TARGET="esp32s3"

# Console output via USB CDC (TinyUSB)
CONFIG_ESP_CONSOLE_USB_CDC=y
CONFIG_ESP_CONSOLE_UART_DEFAULT=n
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=n
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# USB OTG Hardware Configuration
CONFIG_USB_OTG_SUPPORTED=y
CONFIG_USB_HOST_CONTROL_TRANSFER_MAX_SIZE=256

# TinyUSB Configuration - CDC + NCM composite device
CONFIG_TINYUSB_ENABLED=y
CONFIG_TINYUSB_CDC_ENABLED=y
CONFIG_TINYUSB_CDC_COUNT=1
CONFIG_TINYUSB_NET_MODE_NCM=y
CONFIG_TINYUSB_NET_ENABLED=y

# USB Descriptors
CONFIG_TINYUSB_DESC_CUSTOM_VID=0x303A
CONFIG_TINYUSB_DESC_CUSTOM_PID=0x4001
CONFIG_TINYUSB_DESC_MANUFACTURER_STRING="ESP32-Test"
CONFIG_TINYUSB_DESC_PRODUCT_STRING="USB CDC+NCM Test"
CONFIG_TINYUSB_DESC_SERIAL_STRING="123456"
CONFIG_TINYUSB_DESC_BCD_DEVICE=0x0100

# Logging - DEBUG for USB troubleshooting
CONFIG_LOG_DEFAULT_LEVEL_DEBUG=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# PSRAM disabled
CONFIG_SPIRAM=n

# HTTP Server
CONFIG_HTTPD_MAX_REQ_HDR_LEN=512
CONFIG_HTTPD_MAX_URI_LEN=512

# LWIP
CONFIG_LWIP_NETIF_LOOPBACK=y

# FreeRTOS - TinyUSB needs sufficient stack
CONFIG_FREERTOS_HZ=1000
